# Требования к проекту  
### *Chat-bot*


# Содержание

 1.	[Введение](#1)   
   1.1. [Суть проекта](#1.1)    
   1.2. [Перспективы](#1.2)  
   1.3  [Границы проекта](#1.3)  
 
 2.	[Требования пользователя](#2)   
   2.1. [Программные интерфейсы](#2.1)   
   2.2. [Интерфейс пользователя](#2.2)   
   2.3. [Характеристики пользователей](#2.3) 
   
 3.	[Системные требования](#3)    
   3.1. [Функциональные требования](#3.1)   
   3.2. [Нефункциональные требования](#3.2)   
         
 4.	[Аналоги](#4) 
 
---
##  1.	Введение <a name="1"></a>     
###     1.1	Суть проекта.<a name="1.1"></a>

В данном проекте планируется реализовать чат-бота -  программу, которая выясняет потребности пользователей, а затем помогает удовлетворить их. Сегодня почти каждая компания имеет чат-бота для взаимодействия с пользователями. 

###     1.2 Перспективы.<a name="1.2"></a> 
В будущем проект может быть интегрирован в медиа компании, при этом базу данных запросов можно сделать закрытой для сохранения конфиденциальности информации.  
###	    1.3 Границы проекта.<a name="1.3"></a>      
Запланированный проект имеет ограниченный и специализированный набор функционала. Для того чтобы расширить границы программного продукта, функционал необходимо увеличить(добавить поддержку кросплатформенности, добавить алгоритм выбора наиболее кратких ответов, расширить базу данных анализируемых фраз пользователя), но т.к. база данных оперирует в основном конфиденциальной информацией, возникает проблема защиты от несанкционированного доступа.

## 2.	Требования пользователя<a name="2"></a> 

### 2.1	Программные интерфейсы<a name="2.1"></a>   

-	Интерфейс связи между приложением и данными в Google.  
-	Интерфейс связи между приложением и пользователем посредством анализирования голоса.    
-	Использование *JavaScript* в качестве интерфейса *GUI* в браузере.    


### 2.2	Интерфейс пользователя<a name="2.2"></a>   
### Окно главного меню
![alt text](https://github.com/EfimSirotkin/lab2-tritpo/blob/master/Images/Main.JPG)  

Из окна главного меню пользователь(учитель, заместитель директора, директор, экономист и проч.) имеют возможность перейти на страницу просмотра списка сотрудников и на страницу с аналитикой, однако на страницу для редактирования перейти может лишь лицо(директор, заместители, главный бухгалтер, начальник отдела кадров), обладающее соответствующими правами  
### Окно общения с чат-ботом 
![alt text](https://github.com/EfimSirotkin/lab2-tritpo/blob/master/Images/Chat.JPG)

### 2.3	Характеристики пользователей<a name="2.3"></a>   

Целевая аудитория:  
-	Посетители интернет-порталов
- Пользователи Desktop-приложений

## 3. Системные требования<a name="3"></a>   
### 3.1 Функциональные требования<a name="3.1"></a> 
#### 3.1.1 Основные функции 
#####	Ввод поисковых запросов  
#####	Ввод вопросов, с целью общения с ботом из его базы данных  
#####	Информирование о мировых событиях
#####	Дальнейшее обучение искуственного интеллекта   

### 3.2	Нефункциональные требования<a name="3.2"></a> 

##### 3.2.1	Атрибуты качества
-	При запуске программы происходит синхронизация данных(загрузка базы данных запросов из определенной папки).
-	Ввод некорректных вопросов невозможен
-	Сохранение данных базы данных при закрытии программы
-	Загрузка данных из наиболее популярных поисковиков, например Google и Yandex
##### 	3.2.2	Внешние интерфейсы
-	Интерфейс и его элементы стандартны и их назначение понятно интуитивно.  
-	Простота изложения информации.  

### 4. Аналоги<a name="4"></a> 

#### Бот от медиа-компании CNN 
 ![alt text](https://github.com/EfimSirotkin/lab2-tritpo/blob/master/Images/ASOD.png)  
Бот, показывающий статьи по выбранной пользователем теме, а при подписке ежедневно радует читателя новостями и свежайшими публикациями.

#### Девушка-бота от Microsoft под именем Xiaoice

С Xiaoice делятся своими переживаниями более 20 млн человек. 
Этот чатбот постоянно учится на своих диалогах, а его речь и поведение в чате очень похожи на человеческие.
Удивительно, как Xiaoice чутко относится к чувствам своих собеседников, – так, если у человека что-то произошло, в следующем диалоге она может поинтересоваться, как он себя чувствует.
